[
  {
    "id": 1,
    "imagem": "/aurora.png",
    "nome": "Site Aurora",
    "descricao": "Nesse projeto, fui responsável pela criação do <strong>site institucional em 3 idiomas para a Aurora Distribuidora</strong>, a única distribuidora de alumínio que utiliza inteligência artificial na América latina. O site foi desenvolvido com o objetivo de divulgar os serviços da empresa e captar parceiros por meio de um <strong>design clássico e minimalista</strong>, ressaltando os valores da organização.",
    "link": "https://auroraimport.com.br",
    "data": "29/06/2024",
    "commits": 86
  },
  {
    "id": 2,
    "imagem": "/idf.png",
    "nome": "Site IDF Brasil",
    "descricao": "Este projeto consiste na criação de um <strong>site institucional para a IDF Brasil</strong>, uma organização sem fins lucrativos que tem a missão de preservar e conservar a fauna brasileira. O site foi desenvolvido com o objetivo de <strong>divulgar as ações da organização, captar doações e promover a preservação da fauna</strong> por meio de conteúdos acessíveis e interativos.",
    "link": "https://idfbrasil.org/",
    "data": "27/05/2024",
    "commits": 260
  },
  {
    "id": 3,
    "imagem": "/infoteca.png",
    "nome": "Infoteca V2 Consulting",
    "descricao": "Aplicação web completa para <strong>facilitar o gerenciamento dos conteúdos gerados pelas empresas</strong>, agilizando e facilitando as atividades de comunicação interna, treinamento, execução de processos e monitoramento do ambiente de trabalho. A Infoteca possibilita esses ganhos por meio do <strong>gerenciamento de publicações, de testes de conhecimento e de trilhas</strong>, além da restrição de publicações a grupos e cargos específicos.",
    "link": "https://v2consulting.com.br/",
    "data": "20/03/2024",
    "commits": 800
  },
  {
    "id": 4,
    "imagem": "/rpa-lello.png",
    "nome": "RPA - Extração de Relatórios",
    "descricao": "Este projeto consiste na <strong>automatização da extração de relatórios de atendimentos</strong> da <strong>Lello Condomínios</strong>, uma das maiores administradoras de condomínios do Brasil. O sistema foi desenvolvido para <strong>viabilizar a extração diária de mais de 10 relatórios</strong>, de modo que nenhuma interação humana seja necessária para a execução do processo. Da extração até o envio ao <strong>bucket da AWS</strong>, tudo é feito de forma automática e programada.",
    "link": "https://www.lellocondominios.com.br/",
    "data": "04/03/2024",
    "commits": 100
  },
  {
    "id": 5,
    "imagem": "/csi.png",
    "nome": "Cyber Sec Info",
    "descricao": "Este projeto é uma aplicação web chamada Cyber Security Information, desenvolvida por mim e mais 2 alunas do IFSP - Câmpus São Paulo  Pirituba. Ele <strong>oferece conteúdo teórico, tutoriais e ferramentas gratuitas para democratizar o acesso à Segurança Cibernética</strong>. A aplicação é acessível em vários dispositivos e inclui recursos de acessibilidade, como tradução para LIBRAS usando VLIBRAS. Para mais detalhes, consulte os tópicos abaixo.",
    "link": "https://github.com/VictorGM01/cyber_sec_info",
    "data": "01/01/2023",
    "commits": 808
  },
  {
    "id": 6,
    "imagem": "/athena.png",
    "nome": "Athena Web",
    "descricao": "Este projeto, fruto da colaboração entre Inteli e Nova Escola, visa <strong>apoiar professores da rede pública no diagnóstico da aprendizagem dos alunos e recomendar conteúdos pedagógicos</strong>. A Athena é uma aplicação web que gerencia turmas, avaliações e alunos, identificando dificuldades através dos dados das avaliações e fornecendo gráficos e planos de aulas para acompanhamento e recomendações.",
    "link": "https://github.com/VictorGM01/athena",
    "data": "25/06/2023",
    "commits": 389
  }
]
